Revit 2027 API
BuiltInFailures.OverlapFailures.SpaceSeparationLinesOverlap Property
 Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpaceSeparationLinesOverlap { get; }
Public Shared ReadOnly Property SpaceSeparationLinesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpaceSeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
static member SpaceSeparationLinesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace